
## Terraform plan for environment: `int`

**Commit:** c804d70d64f13feb19508fb79220ffd30e60068e


**API version:** 418eb0c
**CLI version:** 418eb0c
**Selfserve version:** 418eb0c
**Internal version:** 418eb0c

### Plan summary

`1 to add, 1 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.eventbridge.aws_iam_role.eventbridge[0]
```
**🔄 Updates**

```tf
module.service.aws_s3_bucket_policy.bucket_policy
```


----

<details data-gh-workflow="int-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.service.aws_s3_bucket_policy.bucket_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "bucket_policy" {
        id     = "vol-app-assets"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringEquals = {
                              ~ "aws:SourceArn" = "arn:aws:cloudfront::054614622558:distribution/E3R9S2AKJG4ZTR" -> "arn:aws:cloudfront::054614622558:distribution/E1GZYPKGUFNMP4"
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # module.service.module.eventbridge.aws_iam_role.eventbridge[0] will be created
  + resource "aws_iam_role" "eventbridge" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "default"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "default"
        }
      + tags_all              = {
          + "Environment" = "int"
          + "Name"        = "default"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

</details>